android/lib/src/main/res/raw/ws_goto_preset.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body>
        <GotoPreset xmlns="http://www.onvif.org/ver20/ptz/wsdl">
            <ProfileToken>%1$s</ProfileToken>
            <PresetToken>%2$s</PresetToken>
        </GotoPreset>
    </s:Body>
</s:Envelope>